Revit 2024 API
CompoundStructureLayer Constructor (Double, MaterialFunctionAssignment, ElementId)
 Creates a default compound structure layer based on the given width, function and material element id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public CompoundStructureLayer(
	double width,
	MaterialFunctionAssignment function,
	ElementId materialId
)
Visual Basic
Public Sub New ( _
	width As Double, _
	function As MaterialFunctionAssignment, _
	materialId As ElementId _
)
Visual C++
public:
CompoundStructureLayer(
	double width,
	MaterialFunctionAssignment function,
	ElementId^ materialId
)
Parameters
width
Type: System.Double
 The width of the layer.
function
Type: Autodesk.Revit.DB.MaterialFunctionAssignment
 The function of the layer.
materialId
Type: Autodesk.Revit.DB.ElementId
 The material element id of the layer.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
CompoundStructureLayer Class
CompoundStructureLayer Overload
Autodesk.Revit.DB Namespace